TEST1/meshConvergenceStudy/cases/fine/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  left     { type symmetryPlane; }
  right     { type symmetryPlane; }
  front     { type symmetryPlane; }
  back     { type symmetryPlane; }

  substrate     { type fixedFluxPressure; value uniform 0; }
  donor
  {
      type            zeroGradient;
  }
}

// ************************************************************************* //
