TEST1/meshConvergenceStudy/cases/fine/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default          Euler;              // ✓ GOOD - First-order, stable
    ddt(alpha)       Euler;              // ✓ GOOD - Consistent with alpha equation
    ddt(rho,U)       Euler;              // ✓ GOOD - Momentum conservation
    ddt(rho)         Euler;              // ✓ GOOD - Mass conservation
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 0.5;
    grad(alpha.metal) cellLimited Gauss linear 1;
    grad(Te)        cellLimited Gauss linear 0.5;
    grad(Tl)        cellLimited Gauss linear 0.5;
    // If you have a single-phase gas T field too:
    grad(T)         cellLimited Gauss linear 0.5;
}

divSchemes
{
    default                          Gauss linear;

    // Interface transport - GOOD improvements made
    div(phi,alpha)                   Gauss vanLeer;        // ✓ GOOD change from vanLeer
    div(phir,alpha)                  Gauss interfaceCompression; // REQUIRED: specialised scheme for compression flux
    div(phi,alpha.metal)             Gauss vanLeer;        // ✓ GOOD
    div(phir,alpha.metal)            Gauss interfaceCompression; // REQUIRED: specialised scheme for compression flux
    div(phi,alpha.air)               Gauss vanLeer;        // ✓ GOOD

    // Momentum - could be more conservative
    div(rhoPhi,U)                    Gauss linearUpwind grad(U); // IMPROVE: Add gradient limiting
    
    div(phi,T)       Gauss upwind;           // Changed from limitedLinear
    div(phi,Te)      Gauss upwind;           // Changed from limitedLinear
    div(phi,Tl)      Gauss upwind;           // Changed from limitedLinear
    
    // Pressure gradient - good change
    div(phi,p_rgh)                   Gauss upwind;           // ✓ GOOD change from linear
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;       // ✓ OK for viscous terms
}
laplacianSchemes
{
   default                          Gauss linear corrected;

    laplacian((1|A(U)),p_rgh)        Gauss linear corrected;
    laplacian(rAU,p_rgh)             Gauss linear corrected;
    laplacian((1|A(U)),p)            Gauss linear corrected;

    laplacian(nuEff,U)               Gauss linear corrected;
    laplacian((rho*nuEff),U)         Gauss linear corrected;

    // ✅ CRITICAL: Orthogonal correction for diffusion stability
    laplacian(alphaEff,T)            Gauss linear orthogonal;
    laplacian(kappaEff,T)            Gauss linear orthogonal;
    laplacian(kappa,T)               Gauss linear orthogonal;

    laplacian(ke,Te)                 Gauss linear orthogonal;
    laplacian(kl,Tl)                 Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;                          // ✓ GOOD - robust method
}

fluxRequired
{
    default         no;                                // ✓ GOOD
    p_rgh           yes;                               // ✓ REQUIRED
    alpha.metal     yes;                               // ✓ REQUIRED
    alpha.air       yes;                               // ✓ REQUIRED  
}
