TEST1/meshConvergenceStudy/cases/fine/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: setFields dictionary                 |
|  \\    /   O peration     | Detailed init for LIFT test run                |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\\*---------------------------------------------------------------------------*/
// Only numbers adjusted; no factors/models changed.
// Update the BOX LIMITS below to match your mesh (in meters).
// Coordinate convention: X,Z lateral, Y vertical (gravity in -Y).

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

defaultFieldValues
(
  volScalarFieldValue alpha.metal 0
  volScalarFieldValue alpha.air   0
  volScalarFieldValue Tl          300
  volScalarFieldValue Te          300
  volScalarFieldValue T           300
);

regions
(
    // Receiver substrate (bottom solid)
    boxToCell
    {
        box (0        0          0)
            (50.0e-06 8.0000e-06 10.0e-06);

        fieldValues
        (
            volScalarFieldValue alpha.metal 1
            volScalarFieldValue alpha.air   0
        );
    }

    // Air gap between substrate and donor film
    boxToCell
    {
        box (0        8.0000e-06 0)
            (50.0e-06 20.0000e-06 10.0e-06);

        fieldValues
        (
            volScalarFieldValue alpha.metal 0
            volScalarFieldValue alpha.air   1
        );
    }

    // Thin donor metal film atop the air gap
    boxToCell
    {
        box (0        20.0000e-06 0)
            (50.0e-06 20.0714e-06 10.0e-06);

        fieldValues
        (
            volScalarFieldValue alpha.metal 1 // pure donor metal film
            volScalarFieldValue alpha.air   0 // exclude air within the film
        );
    }
);
